Revit 2027 API
IndependentTag.IsLeaderVisible Method
 Returns if leader that points to specified reference is visible or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLeaderVisible(
	Reference referenceTagged
)
Public Function IsLeaderVisible (
	referenceTagged As Reference
) As Boolean
public:
bool IsLeaderVisible(
	Reference^ referenceTagged
)
member IsLeaderVisible :
        referenceTagged : Reference -> bool
Parameters
referenceTagged Reference
 The reference which is tagged.
Return Value
Boolean
 Returns true if leader that points to specified reference is visible, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The specified reference is not currently tagged.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The IndependentTag object does not have a tag behavior.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace